In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import OneHotEncoder

In [2]:
titanic_dataset = pd.read_csv("Dataset/test.csv")

In [3]:
titanic_dataset

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [4]:
lis = np.array(["Passenger ID","Passenger Ticket Class","Name","Gender","Age","No of siblings/spouses aboard","No of parents/children aboard","Ticket number","Passenger fare","Cabin number","Port of Embarkation"])

In [5]:
titanic_dataset.columns = lis

In [6]:
titanic_dataset

,Passenger ID,Survived or not?,Passenger Ticket Class,Name,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard,Ticket number,Passenger fare,Cabin number,Port of Embarkation
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
titanic_dataset.count()

Passenger ID                     891
Survived or not?                 891
Passenger Ticket Class           891
Name                             891
Gender                           891
Age                              714
No of siblings/spouses aboard    891
No of parents/children aboard    891
Ticket number                    891
Passenger fare                   891
Cabin number                     204
Port of Embarkation              889
dtype: int64

In [8]:
titanic_dataset["Cabin number"].count()*100/titanic_dataset["Name"].count()

22.895622895622896

In [9]:
titanic_df1 = titanic_dataset.drop("Cabin number",axis=1,inplace=False)

In [10]:
titanic_df1

,Passenger ID,Survived or not?,Passenger Ticket Class,Name,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard,Ticket number,Passenger fare,Port of Embarkation
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [11]:
titanic_dataset["Age"].count()*100/titanic_dataset["Name"].count()

80.13468013468014

In [12]:
titanic_df2 = titanic_df1.drop("Port of Embarkation",axis=1,inplace=False)

In [13]:
titanic_df2

,Passenger ID,Survived or not?,Passenger Ticket Class,Name,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard,Ticket number,Passenger fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500

In [14]:
titanic_df3 = titanic_df2.drop(["Name","Ticket number","Passenger fare"],axis=1,inplace=False)

In [15]:
titanic_df3

,Passenger ID,Survived or not?,Passenger Ticket Class,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,1,0,3,male,22.0,1,0
1,2,1,1,female,38.0,1,0
2,3,1,3,female,26.0,0,0
3,4,1,1,female,35.0,1,0
4,5,0,3,male,35.0,0,0
...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0
887,888,1,1,female,19.0,0,0
888,889,0,3,female,NaN,1,2
889,890,1,1,male,26.0,0,0
890,891,0,3,male,32.0,0,0

In [16]:
med_age = titanic_df3["Age"].median()

In [17]:
titanic_df4 = titanic_df3.copy()
titanic_df4["Age"] = titanic_df4["Age"].fillna(med_age)

In [18]:
titanic_df4

,Passenger ID,Survived or not?,Passenger Ticket Class,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,1,0,3,male,22.0,1,0
1,2,1,1,female,38.0,1,0
2,3,1,3,female,26.0,0,0
3,4,1,1,female,35.0,1,0
4,5,0,3,male,35.0,0,0
...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0
887,888,1,1,female,19.0,0,0
888,889,0,3,female,28.0,1,2
889,890,1,1,male,26.0,0,0
890,891,0,3,male,32.0,0,0

In [19]:
titanic_df5 = titanic_df4.copy()
titanic_df5["Gender"] = titanic_df5["Gender"].map({"male":1,"female":0})

In [20]:
titanic_df5

,Passenger ID,Survived or not?,Passenger Ticket Class,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,1,0,3,1,22.0,1,0
1,2,1,1,0,38.0,1,0
2,3,1,3,0,26.0,0,0
3,4,1,1,0,35.0,1,0
4,5,0,3,1,35.0,0,0
...,...,...,...,...,...,...,...
886,887,0,2,1,27.0,0,0
887,888,1,1,0,19.0,0,0
888,889,0,3,0,28.0,1,2
889,890,1,1,1,26.0,0,0
890,891,0,3,1,32.0,0,0

In [55]:
encod = OneHotEncoder(dtype=np.int64,drop=[3])
model = encod.fit((np.array(titanic_df5["Passenger Ticket Class"])).reshape(-1,1))

In [56]:
model

OneHotEncoder(drop=[3], dtype=<class 'numpy.int64'>)

In [57]:
one_hot_array = model.transform((np.array(titanic_df5["Passenger Ticket Class"])).reshape(-1,1)).toarray()
one_hot = pd.DataFrame(data=one_hot_array,columns=[1,2])
one_hot

     1  2
0    0  0
1    1  0
2    0  0
3    1  0
4    0  0
..  .. ..
886  0  1
887  1  0
888  0  0
889  1  0
890  0  0

[891 rows x 2 columns]

In [62]:
titanic_df6 = titanic_df5.drop("Passenger Ticket Class",axis=1,inplace=False)
titanic_df6.insert(2,"Ticket Class 1",one_hot[1])
titanic_df6.insert(3,"Ticket Class 2",one_hot[2])
titanic_df6

,Passenger ID,Survived or not?,Ticket Class 1,Ticket Class 2,Gender,Age,No of siblings/spouses aboard,No of parents/children aboard
0,1,0,0,0,1,22.0,1,0
1,2,1,1,0,0,38.0,1,0
2,3,1,0,0,0,26.0,0,0
3,4,1,1,0,0,35.0,1,0
4,5,0,0,0,1,35.0,0,0
...,...,...,...,...,...,...,...,...
886,887,0,0,1,1,27.0,0,0
887,888,1,1,0,0,19.0,0,0
888,889,0,0,0,0,28.0,1,2
889,890,1,1,0,1,26.0,0,0
890,891,0,0,0,1,32.0,0,0

In [64]:
titanic_df6["No of siblings/spouses aboard"].max()

8

In [67]:
titanic_df6.columns

Index(['Passenger ID', 'Survived or not?', 'Ticket Class 1', 'Ticket Class 2',
       'Gender', 'Age', 'No of siblings/spouses aboard',
       'No of parents/children aboard'],
      dtype='object')

In [70]:
titanic_df6.to_csv("Dataset/preprocessed_train.csv")

In [68]:
X_train = titanic_df6.drop("Survived or not?",axis=1,inplace=False)
Y_train = titanic_df6["Survived or not?"]

In [69]:
titanic_test = pd.read_csv("Dataset/test.csv")
titanic_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [65]:
from sklearn.svm import LinearSVC

In [ ]:
regr = LinearSVC(dual=False,verbose=2)
model = regr.f